#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("МассивОбъектов") И ТипЗнч(Параметры.МассивОбъектов) = Тип("Массив") Тогда
		Для Каждого Ссылка Из Параметры.МассивОбъектов Цикл
			МассивОбъектов.Добавить(Ссылка);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБлокиПечати

&НаКлиенте
Процедура БлокиПечатиВключенПриИзменении(Элемент)

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)

КонецПроцедуры

&НаКлиенте
Процедура Вверх(Команда)

КонецПроцедуры

&НаКлиенте
Процедура Вниз(Команда)

КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
