#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СодержимоеОбщегоМакета(Знач ИмяМакета) Экспорт

	СодержимоеМакета = ПолучитьОбщийМакет(ИмяМакета).ПолучитьТекст();     
	Возврат СодержимоеМакета; 
	
КонецФункции

Функция СовместимостьВнешнейКомпонентыИзФайла(Знач ИмяМакета) Экспорт
	
	ВремИмяМакета = СтрРазделить(ИмяМакета,".", Ложь);
	ВремИмяМакета = ВремИмяМакета[ВремИмяМакета.ВГраница()];
	ДвоичныеДанные = ПолучитьОбщийМакет(ВремИмяМакета);
		
	Результат = ВнешниеКомпонентыБПО.ИнформацияОКомпонентеИзФайла(ДвоичныеДанные, Ложь);
	Если Результат.Разобрано Тогда
		Возврат Результат.Реквизиты;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли

