#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//   МассивОбъектов  - Массив из ДокументСсылка - ссылки на объекты печати.
//   ПараметрыПечати - Структура - дополнительные настройки.
//   КоллекцияПечатныхФорм - ТаблицаЗначений - коллекция для вывода сформированных табличных документов.
//   ОбъектыПечати   - СписокЗначений - соответствие объекта и имени области в табличном документе.
//   ПараметрыВывода  - Структура - параметры вывода (см. УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
